//Задача №1 напишите программу, которая на вход принимает два числа и проверяет, является ли первое число квадратом второго//
int a = 2;
int b = 4;
if (a == b * b)
    {
        Console.WriteLine("Первое число является квадратом второго");
    }
if (b == a * a)
    {
        Console.WriteLine("Второе число является квадратом первого");
    }